// 5. 需求 ： 分析以下需求并实现
//           1.定义一个用于存放班级分数的数组var score = [80,90,85,90,78,88,89,93,98,75];
//           2.求出班级不及格人数(分数低于60分的就是不及格) ?? 
//           3.求出班级的平均分
//           4.求出班级的总分数
// 分析    ：定义数组，， 
            // 循环数组所有元素，判断是否小于60，如果小于则打印不及格
            // 定义两个变量用来接受总分,和平均值
            //  平均值等于总分除以数组长度

    var score = [80,90,85,90,78,88,89,93,98,75]
    var num=0
    var pjz=0
    for(i=1;i<score.length;i++){
        if(score[i]<60){
            console.log('不及格')
        }
       num+=score[i]
    }
    pjz=num/score.length
    console.log(num)
    console.log(pjz)