
# a+  以读写的方式创建文件，如果有在原有的内容上增加，没有则创建
# r   以只读方式打开文件。文件的指针将会放在文件的开头。这是默认模式。
# w   打开一个文件只用于写入。如果该文件已存在则打开文件，并从开头开始编辑，即原有内容会被删除。如果该文件不存在，创建新文件。
# fp = open('D:/text.txt', 'a+')
# print('Hello,word', file=fp)
# fp.close()
# -----------------------------------------------------------------------------------
# 转义字符
# print('hello \n word ')     #换行
# print('\t helloword')       #空格  （四个）
# print('hello\rworld')       #回车 world 覆盖了hello
# print('hello\bword')        #退格 会覆盖o
# print('http:\\\\www.baidu.com')   #转义
# 注意  ： 最后一个字符不可以转义 会报错
# -----------------------------------------------------------------------------------
#  print(chr(0b100111001011000))   #chr() 返回值是当前整数对应的 ASCII 字符。  0b 转为
# 以0b开头表示的是二进制
# 以0o开头表示的是八进制
# 以0x开头表示的是十六进制
# bin(10)  # 十进制转换为二进制
# bin(0o23)  # 八进制转换为二进制

# 获取ascII码使用ord()函数
# ord('a')'
# -----------------------------------------------------------------------------------
# 保留字
# import keyword
# print(keyword.kwlist)
# name = '闫雨龙'
# print(id(name))       #变量存储的id
# print(type(name))     #变量的类型
# -----------------------------------------------------------------------------------
# 数据类型
# int      整数类型
# float   浮点类型
# bool    布尔值
# str     字符串

# n1 = 1.1
# n2 = 1.3
# print(n1+n2)
# # 解决浮点类型计算不准确的方法
# from decimal import Decimal
# print(Decimal('1.1')+Decimal('1.2'))
# # 布尔值
# # true 为1
# # false 为0
#
# str1 = '''三引号
# 可以换行'''
# print(str1)
#
# # str()转字符串
# age=18
# print('我'+str(age)+'岁了')    #字符串拼接必须转换类型#
# n1 = '88'
# n2 = '2.315'
# # print(int(n1),int(n2))       报错 （int 不可以转文字类和小数类字符串）
# print(int(n1))
# # 注释
# # 单行注释
# # 开头  知道换行
# # 三引号“”hewllo“”   调用就是字符串，不但用就是多行注释
# -----------------------------------------------------------------------------------

# 函数
# present = input('我是输入函数？')
# print(present)            #输入函数，类似弹出框，
# n1 = input('输入第一个数')
# n2 = input('输入第二个数')
# print(int(n1)+int(n2))         #input方法返回值为 字符串 计算需要转换为数字

# -----------------------------------------------------------------------------------

# 运算符
# + - * / //(整除运算符) $(取余运算符） **（幂运算符）
# print(11//5)    #2   整除运算
# print(11%5)     #1   取余
# print(2**3)     #2的三次幂

# 正负数特殊运算
# print(11//-2)     # 一正一负整除运算结果向下取整  11/2=5....1   -5向下取整为-6
#
# # 一正一负取余运算要遵循公式     余数 = 被除数 - 除数 * 商
# print(11%5)                  # 1  =-  11 - 5 * 2

# 链式赋值
# a=b=c=20       # id(a)=id(b)=id(c)
# a,b = 10,20
# # print(a,b)       #10,20
# a,b = b,a
# print(a,b)         #20,10  快捷交换


# = (赋值运算符)   ==(比较运算符)   is(比较对象标识)
#

# -----------------------------------------------------------------------------------
# 位运算

# print(4&8)            # 4的2进制   00000100
                      # 8的2进制   00001000
#4&8  位数同为一时结果为1            00000000   0

# print(4|8)                       #   00000100
#4|8   位数同为0结果为0否则为1       #  00001000
                                  #  00001100    12