// 1. 1-100之间所有数的总和 与 平均值
var num=0
for(var i=1;i<=100;i++){
num+=i
}
console.log(num)
console.log(num/100)
// 2. 1-100之间所有偶数的和
var num1=0
for(var a=1;a<=100;a++){
    if(a%2==0){
        num1+=a
    }
}
console.log(num1)
// 3. 100以内7的倍数的总和
var num=0
for(i=1;i<=100;i++){
    if(i%7==0){
    num+=i
    }
}
console.log(num)
// 4. 利用JavaScript完成如下九九乘法表
// 5. 用户输入一个数字，列出所有它能够整除的数字。
var n=8
for(i=1;i<=n;i++){
  if(8%i==0){
      console.log(i)
  }
}
// 6. 利用JavaScript求：1+2+3+…+100的和
var num=0
for(var i=1;i<=100;i++){
    num+=i
}
console.log(num)
// 7. 利用JavaScript完成如下功能：要求在1~1000数字之中，找出所有能被5整除，或者被6整除的数字，并在控制台输出这些数字
for(var i=1;i<=1000;i++){
    if(i%5==0||i%6==0){
        console.log(i)
    }
}
// 8. 打印一个 5行4列的矩
  var start = '';
    for (var i = 0; i < 5; i++) {
      for (var j = 0; j < 4; j++) {
        start += '* ';
      }
      start += '\n';
    }
    console.log(start); 

// 9. 利用JavaScript完成输出如下图形（由“空格”和“*”这两种符号组成）（拔高题）
//         * 
//        * * 
//       * * * 
//      * * * * 
//     * * * * * 
console.log(
  `
          * 
         * * 
        * * * 
       * * * * 
      * * * * * 
  `
)
// 10. 利用JavaScript，使用循环语句输出如下菱形图案（由“-”和“*”这两种符号组成） （拔高题）

//      ---*
//      --***
//      -*****
//      *******
//      -*****
//      --***
//      ---*
// 11.利用JavaScript完成输出如下图形（由“空格”和“*”这两种符号组成）
//      55555
//      4444
//      333
//      22
//      1
//      22
//      333
//      4444
//      55555
console.log(`
     55555
     4444
     333
     22
     1
     22
     333
     4444
     55555
`)
// 12.利用JavaScript完成输出如下图形（由“空格”和“*”这两种符号组成）
//      *                      *********
//      ***                   *******
//      *****                *****
//      *******             ***      
//      *********          *  
console.log(`
    *                      *********
    ***                   *******
    *****                *****
    *******             ***      
    *********          *  
`)